// pract4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <conio.h>
#include <stdio.h>



int main()
{
    setlocale(LC_ALL, "RUS");
    std::cout << "Hello World!\n";

    float x, y;
    
    FILE* file;
        if (fopen_s(&file, "coordinates.txt", "r") != 0)
        {
            std::cout << "Возникла проблема при открытие файла" << std::endl;
        }
        else
        {
            fscanf_s(file, "%f %f", &x, &y);
            std::cout << "Точка (" << x << "," << y << ")  расположена в(o): \n";

            if (x > 0 && y > 0)
            {
                std::cout << "I - координатном углу" << std::endl;
            }
            else if (x < 0 && y > 0)
            {
                std::cout << "II - координатном углу" << std::endl;
            }
            else if (x < 0 && y < 0)
            {
                std::cout << "III - координатном углу" << std::endl;
            }
            else if (x > 0 && y < 0)
            {
                std::cout << "IV - координатном углу" << std::endl;
            }
            fclose(file);
            
        }

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
